Revit 2024 API
PDFExportOptions.ExportQuality Property
 The preferred export quality (DPI).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public PDFExportQualityType ExportQuality { get; set; }
Visual Basic
Public Property ExportQuality As PDFExportQualityType
	Get
	Set
Visual C++
public:
property PDFExportQualityType ExportQuality {
	PDFExportQualityType get ();
	void set (PDFExportQualityType value);
}
Remarks
 This quality setting is the equivalent of printer resolution found in advanced printer settings. An effect of the setting is to control tessellation quality.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace